In [1]:
# Import libraries
import pandas as pd
import numpy as np

from sklearn.model_selection import train_test_split
from sklearn.preprocessing import LabelEncoder
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score, classification_report

In [2]:
# LOAD DATASET FROM KAGGLE
df = pd.read_csv("Bank_churn_modelling.csv")
df

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,Num Of Products,Has Credit Card,Is Active Member,Estimated Salary,Churn
0,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
9995,15606229,Obijiaku,771,France,Male,39,5,0.00,2,1,0,96270.64,0
9996,15569892,Johnstone,516,France,Male,35,10,57369.61,1,1,1,101699.77,0
9997,15584532,Liu,709,France,Female,36,7,0.00,1,0,1,42085.58,1
9998,15682355,Sabbatini,772,Germany,Male,42,3,75075.31,2,1,0,92888.52,1
9999,15628319,Walker,792,France,Female,28,4,130142.79,1,1,0,38190.78,0

In [3]:
df.head()

,CustomerId,Surname,CreditScore,Geography,Gender,Age,Tenure,Balance,Num Of Products,Has Credit Card,Is Active Member,Estimated Salary,Churn
0,15634602,Hargrave,619,France,Female,42,2,0.00,1,1,1,101348.88,1
1,15647311,Hill,608,Spain,Female,41,1,83807.86,1,0,1,112542.58,0
2,15619304,Onio,502,France,Female,42,8,159660.80,3,1,0,113931.57,1
3,15701354,Boni,699,France,Female,39,1,0.00,2,0,0,93826.63,0
4,15737888,Mitchell,850,Spain,Female,43,2,125510.82,1,1,1,79084.10,0

In [4]:
# Data Cleaning
# Drop irrelevant columns
df.drop(['CustomerId', 'Surname'],axis= 1, inplace = True)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10000 entries, 0 to 9999
Data columns (total 11 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   CreditScore       10000 non-null  int64
 1   Geography         10000 non-null  object
 2   Gender            10000 non-null  object
 3   Age               10000 non-null  int64
 4   Tenure            10000 non-null  int64
 5   Balance           10000 non-null  float64
 6   Num Of Products   10000 non-null  int64
 7   Has Credit Card   10000 non-null  int64
 8   Is Active Member  10000 non-null  int64
 9   Estimated Salary  10000 non-null  float64
 10  Churn             10000 non-null  int64
dtypes: float64(2), int64(7), object(2)
memory usage: 859.5+ KB

In [5]:
# Encode Categorical Features
# Label Encoding (Gender)

le = LabelEncoder()
df['Gender'] = le.fit_transform(df['Gender'])

# One-Hot Encoding (Geography)
df = pd.get_dummies(df, columns=['Geography'], drop_first=True)


# Define Features & Target
X = df.drop('Churn', axis=1)
y = df['Churn']

# Train-Test Split

X_train, X_test, y_train, y_test = train_test_split(
    X, y, test_size=0.2, random_state=42
)

# Train Classification Model
model = RandomForestClassifier(
    n_estimators=100,
    random_state=42
)

model.fit(X_train, y_train)


# Model Evaluation
y_pred = model.predict(X_test)

print("Accuracy:", accuracy_score(y_test, y_pred))
print(classification_report(y_test, y_pred))

# Feature Importance Analysis
feature_importance = pd.DataFrame({
    'Feature': X.columns,
    'Importance': model.feature_importances_
}).sort_values(by='Importance', ascending=False)

feature_importance

Accuracy: 0.866
              precision    recall  f1-score   support

           0       0.88      0.97      0.92      1607
           1       0.77      0.46      0.57       393

    accuracy                           0.87      2000
   macro avg       0.82      0.71      0.75      2000
weighted avg       0.86      0.87      0.85      2000

              Feature  Importance
2                 Age    0.239783
8    Estimated Salary    0.146638
0         CreditScore    0.144214
4             Balance    0.138613
5     Num Of Products    0.130255
3              Tenure    0.082427
7    Is Active Member    0.041110
9   Geography_Germany    0.025711
1              Gender    0.019258
6     Has Credit Card    0.018722
10    Geography_Spain    0.013268

# CONCLUSION
In this task, a Customer Churn Prediction model was successfully developed using the Churn Modelling Dataset. The dataset was cleaned and prepared by removing irrelevant features and encoding categorical variables such as gender and geography. A supervised classification model (Random Forest) was trained to identify customers who are likely to leave the bank. The model achieved good predictive performance, and feature importance analysis revealed that age, account balance, number of products, customer activity level, and geographic location are the most influential factors affecting customer churn. These insights can help banks design effective customer retention strategies and reduce churn rates.